konohana-tech/ch552g-keyboard-cfw/src/main.c
/* Layer helpers (MO/TO/LT): split from main's poll loop (overlay-frugal,
 * gotcha #39). resolve reads P3 directly so it takes no params;
 * scan returns the emittable byte (0 = nothing) with TRNS->base inside. */
/* NOTE: plain (overlay) helpers: main-loop-only call graph links cleanly
 * (diet 2026-09: __reentrant removed from main.c statics, -638B; ISR only
 * reaches usb.c/vial.c so overlay sharing is link-time safe).
 * vial.c helpers stay __reentrant (ISR context). */
static uint8_t layer_resolve(void) {
  uint8_t al = 0;
  uint8_t j;
  uint16_t bkc;
  for (j = 0; j < 6; j++) {
    uint8_t k;
    if (key_debounced & (1u << j)) continue;
    k = (j < 3) ? j : (uint8_t)(j + 1);
    bkc = keymap[0][k];
    /* MO held = momentary layer (QMK press behavior). */
    if ((bkc & QK_MO_MASK) == QK_MO_BASE) {
      uint8_t bl = (uint8_t)(bkc & 0x1F);
      if (bl < VIAL_LAYERS && bl > al) al = bl;
    } else if ((bkc & QK_LT_MASK) == QK_LT_BASE) {
      /* LT held likewise (layer in bits 11:8). */
      uint8_t ll = (uint8_t)((bkc >> 8) & 0x0F);
      if (ll < VIAL_LAYERS && ll > al) al = ll;
    }
  }
  if (!(P3 & ENC_SW_PIN)) {
    bkc = keymap[AL_GET()][7];
    if (bkc == KC_TRNS) bkc = keymap[0][7];
    if ((bkc & QK_MO_MASK) == QK_MO_BASE) { /* switch MO handled by resolve */
      uint8_t bl = (uint8_t)(bkc & 0x1F);
      if (bl < VIAL_LAYERS && bl > al) al = bl;
    } else if ((bkc & QK_LT_MASK) == QK_LT_BASE) { /* switch LT: hold-only */
      uint8_t ll = (uint8_t)((bkc >> 8) & 0x0F);
      if (ll < VIAL_LAYERS && ll > al) al = ll;
    }
  }
  /* TO latch (debounce_cnt[0..2] bit7 = layers 1..3; TO writes the same
   * bits exclusively): highest latched wins together with the MO max. */
  {
    uint8_t t = 3;
    while (1) {
      if (debounce_cnt[t - 1] & 0x80) { if (t > al) al = t; break; }
      if (t == 1) break;
      t--;
    }
  }
  /* Tap Dance hold layer (momentary while TD held). */
  if (td_hold_layer && td_hold_layer < VIAL_LAYERS && td_hold_layer > al) al = td_hold_layer;
  key_debounced = (uint8_t)((key_debounced & 0x3F) | (al << 6));
  return al;
}

/* Consumer audio compat (Vial Mute/VolUp/VolDown = 0xA8-0xAA): this FW has no
 * consumer interface, so translate to keyboard-page equivalents
 * (KB_MUTE 0x7F / KB_VOL_UP 0x80 / KB_VOL_DOWN 0x81). All other consumer /
 * system / mouse codes have no keyboard equivalent and stay unsupported. */
static uint8_t kb_compat(uint8_t kc) {
  if(kc>=0xA8 && kc<=0xAA) return (uint8_t)(0x7F + (kc - 0xA8));
  return kc;
}

static uint8_t scan_keycode(uint8_t al, uint8_t k) {
  uint16_t bkc;
  dec_mod = 0;
  /* Layer-action shadow (issue #2, shadow_activ bitmap): a position whose
   * base key is MO/TO/LT stays silent while it is the layer activator
   * (pressed when AL==0 and holding the layer). A position pressed after
   * another key already activated the layer is NOT in the bitmap, so it
   * resolves the live layer binding (QMK press-time binding). Base MT
   * silences only its tracked hold (level MT owns no slot and is
   * re-scanned every poll); base QK_MODS needs no shadow (a held MODS
   * key always owns a slot, so reaching scan means a fresh press ->
   * resolve the live layer). >0x00FF filter covers the rest. */
  if (al) {
    uint8_t b1 = (uint8_t)(keymap[0][k] >> 8);
    /* MO/TO/LT shadow (issue #2): shadow_activ bitmap tracks layer
     * activators — keys that pressed when AL==0 and caused the layer
     * to activate. These positions are silent (they don't emit from
     * the live layer). Keys pressed when AL>0 (layer already active
     * via another key) are NOT in the bitmap → resolve normally. */
    if (shadow_activ & (uint8_t)(1u << k))
      return 0;
    if ((b1 & 0xE0) == 0x20 && mt_packed != 0x07 &&
        (uint8_t)(mt_packed & 0x07) == (uint8_t)(k & 0x07))
      return 0;
  }
  bkc = keymap[al][k];
  if (bkc == KC_TRNS) bkc = keymap[0][k]; /* TRNS -> base */
  if (bkc == 0) return 0; /* NO */
  if (bkc <= 0x00FF) return kb_compat((uint8_t)bkc);
  { /* QK_MODS left (0x0100-0x0FFF): the high-byte low nibble IS the HID mod
     * byte (same mapping as the macro EXT path); right-hand (0x10) stays
     * unsupported. Tap part rides the press-time slots via dec_mod. */
    uint8_t b1 = (uint8_t)(bkc >> 8);
    if (b1 >= 0x01 && b1 <= 0x1F && !(b1 & 0x10)) {
      dec_mod = (uint8_t)(b1 & 0x0F);
      return kb_compat((uint8_t)(bkc & 0xFF));
    }
  }
  return 0; /* MT / action / TD (0x5700+) / macro (0x7700+) */
}

void main(void) {
  uint8_t report[8];
  uint8_t p1, p3;
  static uint8_t prev_report[8]; /* zero-cleared by CRT; compared before first send */
  uint8_t i, changed;
  uint8_t kc;

  SAFE_MOD = 0x55; SAFE_MOD = 0xAA;
  CLOCK_CFG = CLOCK_CFG & ~0x07 | 0x04;
  SAFE_MOD = 0x00;
  TMOD &= 0xF0; TMOD |= 0x01; /* Timer0 mode 1 (16-bit free-run) */
  TH0 = 0; TL0 = 0; TF0 = 0; TR0 = 1; /* overflow 65.5ms @Fsys/12=1MHz */
  { unsigned int d = 5000; while(d--); }

  P3_DIR_PU &= ~(1u << 6);

  P1_MOD_OC &= 0xF1;
  P1_DIR_PU &= 0xF1;
  P3_MOD_OC &= 0xF0;
  P3_MOD_OC |= (1u << 4); /* P3.4 push-pull output: WS2812B DIN */
  P34 = 0; /* DIN low from the start: chain held in reset during ramp */
  P3_DIR_PU &= 0xF0;
  P1_DIR_PU |= 0xBE;
  P3_DIR_PU |= (1u<<2);
  P3_MOD_OC &= ~(ENC_A_PIN | ENC_B_PIN | ENC_SW_PIN);
  P3_DIR_PU &= ~(ENC_A_PIN | ENC_B_PIN | ENC_SW_PIN);

  /* Key-only ISP entry (hold-then-plug only): if KEY1+KEY3+KEY4+KEY6
   * (P1.1+P1.6+P1.5, P3.2) are all held at boot, jump straight to the
   * bootloader WITHOUT enumerating. GPIO is input-configured above, so this
   * read is deterministic. usb_isp_jump()'s detach+wait is harmless here
   * (never attached) and keeps a single jump path. plug-then-hold is
   * intentionally NOT supported (no runtime check -> zero typing interference). */
  if (((P1 & 0x62) == 0) && ((P3 & 0x04) == 0)) usb_isp_jump(); /* never returns */
  /* Factory reset (hold-then-plug only): KEY1(P1.1)+KEY3(P1.6)+KEY5(P1.4)+ENC_SW(P3.3)
   * held at boot erases DataFlash, so vial_init falls back to defaults.
   * Distinct from the ISP combo above (checked first; all-held goes to ISP). */
  if (((P1 & 0x52) == 0) && ((P3 & 0x08) == 0)) dataflash_erase_all();

  enc_override_keycode = 0;
  enc_override_timer = 0;
  mt_pend = 0; /* issue #5 chained-tap idle */
  shadow_activ = 0; /* no layer activators at boot (issue #2) */
  key_debounced = 0x3F;
  for(i=0;i<6;i++) debounce_cnt[i]=0;
  tt_now = 0; lt_prev_tf0 = 0; /* timebase idle; 0xFC-0xFD reserved placeholders */
  lt_stamp = 0; lt_packed = 0x07; /* LT tracker idle */
  mt_stamp = 0; mt_packed = 0x07; mt_mod = 0; mt_tk = 0; dec_mod = 0; /* MT/MODS idle */
  pd_s = 0xFF; /* issue #5 capture idle */
  mc_play = 0; mc_pos = 0; mc_gap = 0; mc_phase = 0; /* macro player idle */
  ms_wheel_rel = 0; /* mouse wheel idle */
  ms_buttons = 0; /* mouse buttons released */
  mc_kc = 0; mc_mod = 0; mc_dlast = tt_now; mc_dtick = 0;
  mc_hk0 = 0; mc_hm0 = 0; mc_hk1 = 0; mc_hm1 = 0; mc_hk2 = 0; mc_hm2 = 0;
  for (i = 0; i < 6; i++) { slot_pos[i] = 0xFF; slot_kc[i] = 0; slot_mod[i] = 0; } /* press-time slots idle */

  rgb_set_defaults(); /* overwritten by DataFlash LED region if valid */
  vial_init();
  USBInit();

