konohana-tech/ch552g-keyboard-cfw/src/main.c
  for (;;) {
    p1 = P1;
    p3 = P3;

    if (!vial_unlocked) {
      uint8_t all_pressed = 1;
      if (p1 & (1u<<1)) all_pressed = 0;
      if (p1 & (1u<<7)) all_pressed = 0;
      if (p1 & (1u<<6)) all_pressed = 0;
      if (p1 & (1u<<5)) all_pressed = 0;
      if (p1 & (1u<<4)) all_pressed = 0;
      if (p3 & (1u<<2)) all_pressed = 0;
      if (p3 & (1u<<3)) all_pressed = 0;
      if (all_pressed) {
        vial_unlocked = 1;
        vial_unlock_in_progress = 0;
        vial_unlock_counter = 0;
      }
    }

    tt_tick(); /* 65.5ms timebase (TF0 edge, read-only) */
    debounce_update(); /* debounce + TO/LT/MT/TD edges */

    /* Layer resolve + press-time emit. Held slots keep their press-time
     * keycode across layer changes (single input per press); fresh presses
     * resolve against the current layer. Encoder switch stays level-based. */
    {
      uint8_t s;
      layer_resolve(); /* active -> key_debounced[7:6]; read back via AL_GET (no local) */
      report[0] = 0; report[1] = 0;
      for (s = 0; s < 6; s++) {
        uint8_t k = slot_pos[s];
        if (k == 0xFF) { report[2+s] = 0; continue; }
        uint8_t bi = (k < 3) ? k : (uint8_t)(k - 1);
        if (key_debounced & (uint8_t)(1u << bi)) { slot_pos[s] = 0xFF; slot_kc[s] = 0; slot_mod[s] = 0; report[2+s] = 0; }
        else if (pd_s == s && mt_packed != 0x07 && !(mt_packed & 0x80)) report[2+s] = 0;
        else { report[2+s] = slot_kc[s]; report[0] |= slot_mod[s]; }
      }
      for (i = 0; i < 6; i++) {
        uint8_t k;
        if (key_debounced & (1u << i)) continue;
        k = (i < 3) ? i : (uint8_t)(i + 1);
        for (s = 0; s < 6; s++) if (slot_pos[s] == k) break;
        if (s < 6) continue;
        kc = scan_keycode(AL_GET(), k);
        if (!kc && !dec_mod) continue;
        /* issue #5: a press during undecided MT takes its slot masked
         * (report held back until decision; QMK waiting_buffer), plus a
         * chained-tap stash (mt_pend=kc: if MT releases first, B emits
         * after the tap override so a fast tap can't vanish inside its
         * window — trial 7 fix). Cleared by hold paths below.
         * B-first (MT idle here) is never masked. MT keys (0/0) skip. */
        for (s = 0; s < 6; s++) if (slot_pos[s] == 0xFF) {
          slot_pos[s] = k; slot_kc[s] = kc; slot_mod[s] = dec_mod;
          if (mt_packed != 0x07 && !(mt_packed & 0x80)) { pd_s = s; mt_pend = kc; }
          else { report[2+s] = kc; report[0] |= dec_mod; }
          break;
        }
      }
      report[0] |= mt_hold_mod(); /* MT hold level (issue #1; 0 unless holding past term) */
      if (!(p3 & ENC_SW_PIN)) {
        uint16_t swb = keymap[AL_GET()][7];
        if (swb == KC_TRNS) swb = keymap[0][7];
        /* QMK mouse buttons (MS_BTN1-5 0xD1-0xD5, bit = code-0xD1;
         * middle = MS_BTN3 0x00D3 -> bit2): level-held bitmap. */
        if (swb >= 0xD1 && swb <= 0xD5) {
          uint8_t want = (uint8_t)(1u << (swb - 0xD1));
          if (want != ms_buttons) { ms_buttons = want; usb_send_mouse(0, 0, want, (int8_t)0); }
        } else {
          kc = scan_keycode(AL_GET(), 7);
          if (dec_mod) report[0] |= dec_mod; /* enc-sw QK_MODS level (MT silent here: no edge infra) */
          if (kc) { for (i = 2; i < 8; i++) if (report[i] == 0) { report[i] = kc; break; } }
          if (ms_buttons) { ms_buttons = 0; usb_send_mouse(0, 0, 0, (int8_t)0); }
        }
      } else if (ms_buttons) { ms_buttons = 0; usb_send_mouse(0, 0, 0, (int8_t)0); }
    }

    if (enc_override_timer && enc_override_keycode) report[2] = enc_override_keycode;

    td_task();
    {
        uint8_t tdk = kb_compat(td_pending_key());
        /* TD hold/tap modifier (0xE0-0xE7): OR into report[0] so chords
         * (e.g. TD-hold LCtrl + 'u') work; report[2] is left intact.
         * Plain keys keep the existing report[2] override. */
        if(tdk >= 0xE0 && tdk <= 0xE7) report[0] |= (uint8_t)(1u << (tdk - 0xE0));
        else if(tdk) report[2] = tdk;
    }

    macro_poll(); /* advance macro player (stack frame, no overlay) */
    if (mc_play || mc_kc || mc_mod || mc_hk0 || mc_hm0 || mc_hk1 || mc_hm1 || mc_hk2 || mc_hm2) {
      /* Macro owns the keys section while active (QMK: macro takes over).
       * Tap/holds merge here; scan keys are suppressed for clean output. */
      report[0] |= (uint8_t)(mc_mod | mc_hm0 | mc_hm1 | mc_hm2);
      report[2] = mc_kc;
      report[3] = mc_hk0;
      report[4] = mc_hk1;
      report[5] = mc_hk2;
      report[6] = 0; report[7] = 0;
    }

    changed=0; for(i=0;i<8;i++) if(report[i]!=prev_report[i]){changed=1;break;}
    if(changed){for(i=0;i<8;i++) prev_report[i]=report[i]; usb_send_report(report);}

    if(enc_override_timer){enc_override_timer--; if(enc_override_timer==0){ if(mt_pend){enc_override_keycode=mt_pend; enc_override_timer=LT_TAP_POLLS; mt_pend=0;} else enc_override_keycode=0;}}
    if(ms_wheel_rel){ ms_wheel_rel--; if(ms_wheel_rel==0) usb_send_mouse(0,0,ms_buttons,(int8_t)0); }

    {
      uint8_t a = (p3 & ENC_A_PIN) ? 1 : 0;
      uint8_t b = (p3 & ENC_B_PIN) ? 1 : 0;
      uint8_t curr = (a<<1)|b;
      static uint8_t last_state=0; static int8_t accum=0; static uint8_t init_done=0;
      if(!init_done){last_state=curr; init_done=1;}
      if(curr!=last_state){
        static const int8_t enc_table[16]={0,-1,1,0,1,0,0,-1,-1,0,0,1,0,1,-1,0};
        uint8_t idx=(last_state<<2)|curr; accum+=enc_table[idx]; last_state=curr;
        if(accum>=4 || accum<=-4){
          uint16_t em = encoder_map[AL_GET()][(accum>=4)?(uint8_t)0:(uint8_t)1];
          /* QMK mouse wheel (MS_WHLU 0x00D9 / MS_WHLD 0x00DA): mouse report
           * + zero-release via ms_wheel_rel. Else legacy keyboard override. */
          if(em==0x00D9){ usb_send_mouse(0,0,ms_buttons,(int8_t)1); ms_wheel_rel=10; }
          else if(em==0x00DA){ usb_send_mouse(0,0,ms_buttons,(int8_t)-1); ms_wheel_rel=10; }
          else { enc_override_keycode=kb_compat((uint8_t)em); enc_override_timer=10; }
          if(accum>=4) accum-=4; else accum+=4;
        }
      }
    }
    {volatile unsigned int d; for(d=0;d<220;d++);}
    dataflash_poll();
    rgb_poll();
  }
}